Revit 2027 API
PerformanceAdviserRuleId Class
 The unique identifier of a PerformanceAdviserRule
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.GuidEnum
 Autodesk.Revit.DB.PerformanceAdviserRuleId
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PerformanceAdviserRuleId : GuidEnum
Public Class PerformanceAdviserRuleId
	Inherits GuidEnum
public ref class PerformanceAdviserRuleId : public GuidEnum
type PerformanceAdviserRuleId =
    class
        inherit GuidEnum
    end
The PerformanceAdviserRuleId type exposes the following members.
Constructors
Name | Description
PerformanceAdviserRuleId | Creates a new PerformanceAdviserRuleId instance.
Top
Properties
Name | Description
Guid |  The Guid of GUID-based enum object.
(Inherited from GuidEnum)
Top
Methods
Name | Description
Equals |  Compares two Guid-based enum object based on their concrete class and GUID value.
(Inherited from GuidEnum)
GetHashCode |  Generates a hash code for this Guid-based enum object.
(Inherited from GuidEnum)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Operators
Name | Description
Equality(PerformanceAdviserRuleId, PerformanceAdviserRuleId) | Compares two PerformanceAdviserRuleId instances.
Inequality(PerformanceAdviserRuleId, PerformanceAdviserRuleId) | Compares two PerformanceAdviserRuleId instances.
Top
Remarks
 Each performance adviser rule registered in application must be given a unique id that can be used to identify and unregister rule later.
See Also
Reference
Autodesk.Revit.DB Namespace